using System;

class Program
{
    static void Main(string[] args)
    {
        // Початок програми

        // Оголошення та ініціалізація змінних:
        int d = 1352;       // Чотиризначне число, яке будемо аналізувати
        int sum = 0;        // Змінна для зберігання суми цифр числа d
        int product = 1;    // Змінна для зберігання добутку цифр числа d

        // Розбиваємо число на цифри та обчислюємо суму та добуток
        while (d > 0)
        {
            int digit = d % 10;     // Отримання останньої цифри числа d
            sum += digit;           // Додавання цифри до суми
            product *= digit;       // Множення цифри на поточний добуток
            d /= 10;                // Видалення останньої цифри числа
        }

        // Виведення результатів на екран:
        Console.WriteLine("S: " + sum);         // Вивід суми цифр числа
        Console.WriteLine("D: " + product);     // Вивід добутку цифр числа

        // Кінець програми
    }
}
